In [1]:
import pandas as pd

data = {'state':['oh','oh','oh','Nev','Nev'],
        'year':[2000,2001,2002,2001,2002],
        'population':[1.5, 1.7, 2.3, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

frame2 = pd.DataFrame(data, columns = ['year', 'state', 'population', 'debt'], 
                  index = ['one', 'two', 'three', 'four', 'five'])
frame2

       year state  population debt
one    2000    oh         1.5  NaN
two    2001    oh         1.7  NaN
three  2002    oh         2.3  NaN
four   2001   Nev         2.9  NaN
five   2002   Nev         3.2  NaN

In [3]:
pd.date_range?

In [8]:
import pandas as pd

s = pd.Series([10,20,30,40,50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [9]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
s.values

array([10, 20, 30, 40, 50], dtype=int64)

In [11]:
s[0]

10

In [12]:
s[1:4]

1    20
2    30
3    40
dtype: int64

In [23]:
s[[1,3,4]]

# 한 번에 다 가져올 수도 있다

1    20
3    40
4    50
dtype: int64

In [26]:
s2 = pd.Series([10,20,30,40], index=['a','b','c','d'])

s2
# index값을 색인이 아니라 특정 이름으로 명명할 수 있다.

# index로 접근할 수도, lable로 접근할 수도 있다.

a    10
b    20
c    30
d    40
dtype: int64

In [40]:
# dataframe
import numpy as np

data = np.arange(12).reshape(3,4)
data
# 0부터 11까지의 숫자를 생성해서 3행4열로 만들자.

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [41]:
df = pd.DataFrame(np.arange(12).reshape(3,4))
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [42]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [43]:
df.columns

# columns도 내부적으로는 인덱스다.

RangeIndex(start=0, stop=4, step=1)

In [44]:
df[0]

# '열' 기준으로 가져온다.

0    0
1    4
2    8
Name: 0, dtype: int32

In [45]:
df.iloc[0]

# '행' 기준으로 가져오는 것은 인덱서라고 한다. 대표적으로 iloc

0    0
1    1
2    2
3    3
Name: 0, dtype: int32

In [46]:
df[0:2]

# 열 기준인줄 알았는데 행 기준으로 바뀌어버린다. 그래서 가급적 이건 쓰지 말아라.

# 0행에서 2행까지 가져오고싶다면? 가급적 iloc 쓸 것.

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [47]:
df.iloc[0:2]

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [67]:
df = pd.DataFrame(data, columns=list('ABCD'))
df

#DataFrame의 columns 속성에 이름 넣어줄 수 있다.

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [68]:
df.columns

# 열 이름 가져오기

Index(['A', 'B', 'C', 'D'], dtype='object')

In [69]:
df.iloc[2]

# 행 단위로 가져오고싶을 때.

A     8
B     9
C    10
D    11
Name: 2, dtype: int32

In [70]:
df.columns = ['a','b','c','d']
df

# 컬럼 이름 바꾸기 : 그냥 다시 할당하면 된다.

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [71]:
df.columns[0] = 'A'

# 컬럼 이름 하나만 바꾸고 싶으면?

# 하나만 바꾸면 오류가 난다. 바꿀 수 없는 속성임.

TypeError: Index does not support mutable operations

In [72]:
# 하나만 바꾸면 오류가 난다. 바꿀 수 없는 속성임. 그래서 전체로 바꿔야함 => rename 사용해도 됨

df.rename(columns={'a':'A'})

# 원본은 바뀌지 않고 복사된 값을 리턴한다. 즉, df = 를 써줘야한다. 그냥 df 출력하면 원본이므로 안바뀜.

   A  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [73]:
df

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [74]:
df.rename(columns={'a':'A'}, inplace = True)
df

   A  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [75]:
df.rename(columns={df.columns[0]:'A'}, inplace = True)
df

# 헷갈리니까 df.columns[0] 로 써줘도 된다.

   A  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [79]:
df = pd.DataFrame(data, columns = list('ABCD'),
                  index = ['one', 'two', 'three'])
df

# 보통은 순번으로 주지만 성적표와 같이 이름이 필요할 때가 있다. index 에 학생 이름이 나오게 하고 싶을 때도 있다.

       A  B   C   D
one    0  1   2   3
two    4  5   6   7
three  8  9  10  11

In [80]:
df['C']

one       2
two       6
three    10
Name: C, dtype: int32

In [82]:
df.C

one       2
two       6
three    10
Name: C, dtype: int32

In [84]:
df

       A  B   C   D
one    0  1   2   3
two    4  5   6   7
three  8  9  10  11

In [85]:
del df['C']
df

# 삭제하기

       A  B   D
one    0  1   3
two    4  5   7
three  8  9  11

In [86]:
df.sort_index()

# 행을 기준으로 해서 index가 정렬된다. o - th - tw

       A  B   D
one    0  1   3
three  8  9  11
two    4  5   7

In [88]:
df

       A  B   D
one    0  1   3
two    4  5   7
three  8  9  11

In [89]:
df.sort_index(ascending=False)

# 오름차순 false이므로 내림차순 정렬이다. 
# 열 정렬하고 싶다면?

       A  B   D
two    4  5   7
three  8  9  11
one    0  1   3

In [90]:
df.sort_index(axis = 0)

# axis = 0 은 default로 행 기준이라는 뜻이다.

       A  B   D
one    0  1   3
three  8  9  11
two    4  5   7

In [91]:
df.sort_index(axis = 1, ascending = False)

# column 기준으로, 열 기준으로 내림차순 정렬된다.

        D  B  A
one     3  1  0
two     7  5  4
three  11  9  8

In [93]:
df.sort_values(by='A', ascending = False)

# 'A'열의 값을 소팅한다.
# 내림차순으로

       A  B   D
three  8  9  11
two    4  5   7
one    0  1   3

In [95]:
df.sort_values(by=['A', 'B'], ascending = False)

# 'A'열과 'B'열의 값을 소팅한다.
# 내림차순으로

       A  B   D
three  8  9  11
two    4  5   7
one    0  1   3

In [100]:
df['A']

# 형태가 series 다

one      0
two      4
three    8
Name: A, dtype: int32

In [101]:
df[['A']]

# 형태가 dataframe이다

       A
one    0
two    4
three  8

In [102]:
df[['A', 'D']]

# 형태가 dataframe이다

       A   D
one    0   3
two    4   7
three  8  11

In [103]:
df

       A  B   D
one    0  1   3
two    4  5   7
three  8  9  11

In [104]:
df['two']

# 컬럼 중에 가져오라는 것이므로 오류다.

KeyError: 'two'

In [105]:
df.loc['two']

# 행 이름으로 가져오려면 이렇게 해야한다.

A    4
B    5
D    7
Name: two, dtype: int32

In [106]:
df.iloc[1]

# 행 가져오려는데 순번으로 가져오려면 이렇게 한다. 위랑 상동

A    4
B    5
D    7
Name: two, dtype: int32

In [107]:
df.loc[1]

# loc는 레이블 기반이라서 오류

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [1] of <class 'int'>

In [108]:
df.iloc['two']

# iloc는 index 기반이다.

TypeError: Cannot index by location index with a non-integer key

In [109]:
df.loc[['two', 'three']]

# 두 개의 행을 가져올 수 있다.

       A  B   D
two    4  5   7
three  8  9  11

In [111]:
# 슬라이싱 하고 싶다면?

df[['A', 'B']].loc[['two', 'three']]

# 열을 먼저 선택하고 loc로 행을 선택해주면 교집합이 출력된다.
# 컬럼 먼저 가져오고, loc나 iloc로 가져올 수 있다.

       A  B
two    4  5
three  8  9

In [ ]:
df.loc[['two', 'three'], ['A', 'B']]

#  ***행먼저 선택하면 이렇게 된다.

In [115]:
df.iloc[1,1]

# numpy에 2차원 인덱싱 하는 것처럼 특정해서 뽑아낼 수도 있다.

5

In [116]:
df.iloc[1:, :2]

# 슬라이싱을 이용해서 기존과 같게 출력한다.

# 1행부터 끝까지, 처음부터 2열 전까지.

       A  B
two    4  5
three  8  9

In [117]:
df.iloc[[1,2], [0,1]]

# 어디 가져온다고 정확하게 꼭 찝는 것.
# fancy indexing 하듯.
# 숫자로!

       A  B
two    4  5
three  8  9

In [118]:
df.loc[['two', 'three'], ['A', 'B']]

# 이름을 집어서 가져옴
# 위의 것을 그대로 레이블로!

       A  B
two    4  5
three  8  9

In [122]:
df.iloc[1,1]

5

In [125]:
df.iat[1,1]

# 하나만 접근할 때

5

In [126]:
df.at['two','B']

5

In [124]:
df

       A  B   D
one    0  1   3
two    4  5   7
three  8  9  11

In [130]:
r = df['A'] > 2
r

# 조건으로 bool 결과를 얻는다.

one      False
two       True
three     True
Name: A, dtype: bool

In [131]:
df[r]

# dataframe에 조건 넣으면

       A  B   D
two    4  5   7
three  8  9  11

In [137]:
df > 4

           A      B      D
one    False  False  False
two    False   True   True
three   True   True   True

In [138]:
df[df>4]

# not a number
# 데이터가 없다.
# 누락 데이터

         A    B     D
one    NaN  NaN   NaN
two    NaN  5.0   7.0
three  8.0  9.0  11.0

In [139]:
df

       A  B   D
one    0  1   3
two    4  5   7
three  8  9  11

In [143]:
df.drop('two', axis = 0)

# 열 기준인지 행 기준인지 명시해야 한다.
# 이것도 역시 원본을 건드리진 않음

       A  B   D
one    0  1   3
three  8  9  11

In [144]:
df

       A  B   D
one    0  1   3
two    4  5   7
three  8  9  11

In [145]:
df.drop('two', axis = 0, inplace = True)

# 원본을 건드리고 싶으면 inplace

In [146]:
df

       A  B   D
one    0  1   3
three  8  9  11

In [147]:
df.drop('B')

# axis 기본값이 0으로 행 기준이기때문에 axis 1 해줘야한다.

KeyError: "['B'] not found in axis"

In [148]:
df.drop('B', axis = 1)

# 삭제하기

       A   D
one    0   3
three  8  11

In [151]:
df = pd.DataFrame(np.arange(12).reshape(3,4), 
                  columns = list('ABCD'))
df

# 새 데이터프레임 생성

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [152]:
df2 = df[df>4]
df2

     A    B     C     D
0  NaN  NaN   NaN   NaN
1  NaN  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [153]:
df2.dropna()


# NaN 있는 행 다 삭제.
# 이것도 역시 원본은 그대로.

     A    B     C     D
2  8.0  9.0  10.0  11.0

In [154]:
df2

     A    B     C     D
0  NaN  NaN   NaN   NaN
1  NaN  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [156]:
df2.dropna(how = 'all')

# 모~든 값이 NA인 것만 삭제한다.

     A    B     C     D
1  NaN  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [158]:
?df2.dropna

In [159]:
df2.dropna(how = 'any')

# 하나라도 NaN 값이 있으면 삭제한다.

     A    B     C     D
2  8.0  9.0  10.0  11.0

In [167]:
df2.dropna(thresh=4)

#정상값은 4개이상 보여야한다.

     A    B     C     D
2  8.0  9.0  10.0  11.0

In [168]:
df2.dropna(thresh=1)

     A    B     C     D
1  NaN  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [165]:
df2.fillna(-1)

# -1 로 값을 채운다.

     A    B     C     D
0 -1.0 -1.0  -1.0  -1.0
1 -1.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [171]:
df2.fillna(method='bfill')

# 밑에 있는 값을 위 NaN 값에 채워 넣는다.

     A    B     C     D
0  8.0  5.0   6.0   7.0
1  8.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [172]:
df2.fillna(method='bfill', axis = 1)

# 옆에 열을 채워넣는다. 5.0 5.0

     A    B     C     D
0  NaN  NaN   NaN   NaN
1  5.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [173]:
?df2.fillna

In [176]:
df2.fillna(value=0, method='bfill')

# 밸류 값 지정하고 메소드도 bfill이면 서로 상충한다.
# Cannot specify both 'value' and 'method'.

ValueError: Cannot specify both 'value' and 'method'.

In [177]:
df.sum()

# 행단위로, 행들을 더한 것. axis = 0

A    12
B    15
C    18
D    21
dtype: int64

In [178]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [179]:
df.sum(axis = 1)

# 열단위로 열들을 더한 것.

0     6
1    22
2    38
dtype: int64

In [181]:
df.describe()

# 기초통계

         A    B     C     D
count  3.0  3.0   3.0   3.0
mean   4.0  5.0   6.0   7.0
std    4.0  4.0   4.0   4.0
min    0.0  1.0   2.0   3.0
25%    2.0  3.0   4.0   5.0
50%    4.0  5.0   6.0   7.0
75%    6.0  7.0   8.0   9.0
max    8.0  9.0  10.0  11.0

In [182]:
df['B'].mean()

# b 컬럼의 평균

5.0

In [186]:
df.loc[:2, ['A', 'B']]

# :2도 레이블 취급.

   A  B
0  0  1
1  4  5
2  8  9

In [187]:
df.loc[:2, ['A', 'B']].sum()

A    12
B    15
dtype: int64

In [188]:
df2

     A    B     C     D
0  NaN  NaN   NaN   NaN
1  NaN  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [189]:
df2.isna()

# na인 값들만 sum

       A      B      C      D
0   True   True   True   True
1   True  False  False  False
2  False  False  False  False

In [190]:
df2.isna().sum()

# 컬럼별로 '행'값들을 더한 것.

A    2
B    1
C    1
D    1
dtype: int64

In [191]:
df2.isna().sum(axis=1)

#  행별로 '열' 값들을 더한 것

0    4
1    1
2    0
dtype: int64

In [192]:
df.apply(np.sum, axis=1)

0     6
1    22
2    38
dtype: int64

In [194]:
df.apply(lambda x : x.max() - x.min())

A    8
B    8
C    8
D    8
dtype: int64

In [195]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [198]:
s = pd.Series(['A a','B b','C c'])
s

0    A a
1    B b
2    C c
dtype: object

In [199]:
s.str.lower()

# str.lower() : 소문자로 바뀐다.

0    a a
1    b b
2    c c
dtype: object

In [200]:
s.str.split()

# split() : 나눈다.

0    [A, a]
1    [B, b]
2    [C, c]
dtype: object

In [202]:
s.str[0], s.str[2]

(0    A
 1    B
 2    C
 dtype: object, 0    a
 1    b
 2    c
 dtype: object)

In [205]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4), columns = list('ABCD'))
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [208]:
df2 = pd.DataFrame(np.arange(10, 22).reshape(3,4), columns = list('ABCD'))
df2
# np.arange(10, 22) 임. 중간에 : 콜론 아님... np.arange(10:22) 노노

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

In [210]:
df3 = pd.concat([df1, df2])
df3

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

In [213]:
df3.iloc[0]

A    0
B    1
C    2
D    3
Name: 0, dtype: int32

In [214]:
df3.iloc[5]

# 이걸보니... 앞의 01234 이건 인덱스가 아니라 레이블이었구나!

A    18
B    19
C    20
D    21
Name: 2, dtype: int32

In [215]:
df3.loc[0]

# 숫자가 아닌 레이블 0이었구나!

    A   B   C   D
0   0   1   2   3
0  10  11  12  13

In [217]:
df4 = pd.concat([df1, df2], keys = ['K1', 'K2'])
df4

# index가 하나가 아닌 두개가 되는 것.
# 대분류, 소분류로 나뉜다.

       A   B   C   D
K1 0   0   1   2   3
   1   4   5   6   7
   2   8   9  10  11
K2 0  10  11  12  13
   1  14  15  16  17
   2  18  19  20  21

In [220]:
df4.iloc[[0, 5]]

       A   B   C   D
K1 0   0   1   2   3
K2 2  18  19  20  21

In [221]:
df4.loc['K1',0]

A    0
B    1
C    2
D    3
Name: (K1, 0), dtype: int32

In [222]:
df4.loc['K2',0]

# 대분류 k2의 소분류 0 주세요.

A    10
B    11
C    12
D    13
Name: (K2, 0), dtype: int32

In [228]:
df1 = pd.DataFrame({'K' : 'k0,k1,k2,k3'.split(','),
                    'A' : 'A0,A1,A2,A3'.split(','),
                    'B' : 'B0,B1,B2,B3'.split(',')
                   })
df1

    K   A   B
0  K0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [229]:
df2 = pd.DataFrame({'K' : 'k1,k2,k3,k4'.split(','),
                    'C' : 'C1,C2,C3,C4'.split(','),
                    'D' : 'D1,D2,D3,D4'.split(',')
                   })
df2

    K   C   D
0  k1  C1  D1
1  k2  C2  D2
2  k3  C3  D3
3  k4  C4  D4

In [231]:
df3 = pd.merge(df1, df2, on='K')
df3

# K 기준으로 테이블 합침
# 교집합 == inner == default / how='inner'

    K   A   B   C   D
0  k1  A1  B1  C1  D1
1  k2  A2  B2  C2  D2
2  k3  A3  B3  C3  D3

In [234]:
df3 = pd.merge(df1, df2, on='K', how='outer')
df3

# K 기준으로 테이블 합침
# 합집합 (==join)

    K    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  k1   A1   B1   C1   D1
2  k2   A2   B2   C2   D2
3  k3   A3   B3   C3   D3
4  k4  NaN  NaN   C4   D4

In [235]:
df3 = pd.merge(df1, df2, on='K', how='left')
df3

# K 기준으로 테이블 합침
# outer 조인이지만, 왼쪽 기준으로 합치기때문에 '4' 행 없다.

    K   A   B    C    D
0  K0  A0  B0  NaN  NaN
1  k1  A1  B1   C1   D1
2  k2  A2  B2   C2   D2
3  k3  A3  B3   C3   D3

In [236]:
df3 = pd.merge(df1, df2, on='K', how='right')
df3

# K 기준으로 테이블 합침
# outer 조인이지만, 오른쪽 기준으로 합치기때문에 nan 나온다.

    K    A    B   C   D
0  k1   A1   B1  C1  D1
1  k2   A2   B2  C2  D2
2  k3   A3   B3  C3  D3
3  k4  NaN  NaN  C4  D4

In [237]:
df = pd.DataFrame({'A' : ['foo','bar','foo','bar','foo','bar'],
                   'B' : ['one', 'two','three','one','two','three'],
                   'C' : np.random.randn(6),
                   'D' : np.random.randn(6)                  
                  })
df

     A      B         C         D
0  foo    one -0.240481  1.514976
1  bar    two  1.755209  0.479339
2  foo  three -1.305520  0.584759
3  bar    one -0.875593  1.875214
4  foo    two  0.044974  1.189355
5  bar  three -1.519588 -0.743197

In [238]:
?np.random.randn

In [239]:
df.groupby('A')

# A 컬럼 기준으로 그룹핑. c열만 봐도 foo에 숫자 세개임. 요소가 여러가지가 있으니까 하나로 출력할 수 있도록 연산이 필요함.

In [240]:
df.groupby('A').sum()

            C         D
A
bar -0.639972  1.611355
foo -1.501028  3.289091

In [242]:
df.groupby('A').mean()

            C         D
A
bar -0.213324  0.537118
foo -0.500343  1.096364

In [245]:
df.groupby('A').agg(['sum','mean'])

            C                   D
          sum      mean       sum      mean
A
bar -0.639972 -0.213324  1.611355  0.537118
foo -1.501028 -0.500343  3.289091  1.096364

In [250]:
df.groupby('A')[['D']].sum()

# C는 말고 D만 필요하다면?

            D
A
bar  1.611355
foo  3.289091

In [254]:
df.groupby('A').sum()

# 숫자만 있는 데이터 컬럼으로만 알아서 출력된다.

            C         D
A
bar -0.639972  1.611355
foo -1.501028  3.289091

In [256]:
df.groupby('A').sum()[['D']]

df.groupby('A')[['D']].sum()

# 위 아래 결과는 같음.

            D
A
bar  1.611355
foo  3.289091

In [257]:
df.groupby(['A','B'])[['C']].agg(['sum','mean','count'])

                  C
                sum      mean count
A   B
bar one   -0.875593 -0.875593     1
    three -1.519588 -1.519588     1
    two    1.755209  1.755209     1
foo one   -0.240481 -0.240481     1
    three -1.305520 -1.305520     1
    two    0.044974  0.044974     1

In [258]:
pd.pivot_table(df, index=['A'])

# 대표값을 추출함.

            C         D
A
bar -0.213324  0.537118
foo -0.500343  1.096364

In [259]:
df

     A      B         C         D
0  foo    one -0.240481  1.514976
1  bar    two  1.755209  0.479339
2  foo  three -1.305520  0.584759
3  bar    one -0.875593  1.875214
4  foo    two  0.044974  1.189355
5  bar  three -1.519588 -0.743197

In [260]:
pd.pivot_table(df, index=['A'], aggfunc='sum')

            C         D
A
bar -0.639972  1.611355
foo -1.501028  3.289091

In [262]:
pd.pivot_table(df, index=['A'], columns=['B'], aggfunc='sum', margins = True)

            C                                       D                      \
B         one     three       two       All       one     three       two
A
bar -0.875593 -1.519588  1.755209 -0.639972  1.875214 -0.743197  0.479339
foo -0.240481 -1.305520  0.044974 -1.501028  1.514976  0.584759  1.189355
All -1.116074 -2.825108  1.800183 -2.141000  3.390190 -0.158438  1.668694


B         All
A
bar  1.611355
foo  3.289091
All  4.900446

In [263]:
pd.pivot_table(df, index=['A'], columns=['B'], aggfunc='sum')

            C                             D
B         one     three       two       one     three       two
A
bar -0.875593 -1.519588  1.755209  1.875214 -0.743197  0.479339
foo -0.240481 -1.305520  0.044974  1.514976  0.584759  1.189355

In [267]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng

# S : 초, M : 분

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [268]:
?pd.date_range

In [269]:
ts = pd.Series(np.random.randint(0,500, len(rng)))
ts

0     103
1     356
2     125
3     321
4     224
     ...
95    397
96    136
97     86
98    240
99     58
Length: 100, dtype: int32

In [270]:
ts.index = rng
ts

2012-01-01 00:00:00    103
2012-01-01 00:00:01    356
2012-01-01 00:00:02    125
2012-01-01 00:00:03    321
2012-01-01 00:00:04    224
                      ...
2012-01-01 00:01:35    397
2012-01-01 00:01:36    136
2012-01-01 00:01:37     86
2012-01-01 00:01:38    240
2012-01-01 00:01:39     58
Freq: S, Length: 100, dtype: int32

In [273]:
ts.resample('5Min')

In [276]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [283]:
utc = rng.tz_localize('UTC')
utc

DatetimeIndex(['2012-03-06 00:00:00+00:00', '2012-03-07 00:00:00+00:00',
               '2012-03-08 00:00:00+00:00', '2012-03-09 00:00:00+00:00',
               '2012-03-10 00:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='D')

In [285]:
df.to_csv('df.csv')